test/unit/BitPaySDK/jsonResponse/payInvoiceResponse.json

{"url":"https://test.bitpay.com/invoice?id=4enjVLZH9fUADcAeYRKip3","status":"complete","price":12,"currency":"USD","itemDesc":"Example","orderId":"e81256cb-b115-45e6-9257-607f692635f1","invoiceTime":1668428388468,"rateRefreshTime":1668428388468,"expirationTime":1668429288468,"currentTime":1668428399474,"guid":"7f3b1a02-d6ee-4185-bcd5-838276a598b5","id":"4enjVLZH9fUADcAeYRKip3","lowFeeDetected":false,"amountPaid":72000,"displayAmountPaid":"0.000720","exceptionStatus":false,"targetConfirmations":6,"guaranteedPaymentTargetConfirmations":0,"guaranteedPayment":false,"transactions":[{"amount":72000,"confirmations":6,"receivedTime":"2022-11-14T12:19:59.429Z","txid":"6f84f6662988c33b70cf977f652632b68a3fd3b30705f0903e61f193441da025","exRates":{"BTC":1,"USD":16678.62,"BCH":162.27190686942083,"ETH":13.317964769950652,"GUSD":16678.62,"PAX":16678.62,"BUSD":16678.62,"USDC":16678.62,"DOGE":191235.02412994052,"LTC":290.72023705769567,"MATIC":18099.42485078676,"USDC_m":16678.62}},{"amount":-100,"confirmations":6,"receivedTime":"2022-11-14T12:19:59.439Z","type":"buyerPaidMinerFee","txid":"6f84f6662988c33b70cf977f652632b68a3fd3b30705f0903e61f193441da025"}],"transactionSpeed":"medium","buyer":{"name":"Marcin","address1":"street","address2":"911","locality":"Washington","region":"District of Columbia","postalCode":"20000","country":"USA","email":"satoshi@buyeremaildomain.com","notify":true},"autoRedirect":true,"refundAddresses":[],"refundAddressRequestPending":false,"buyerProvidedEmail":"satoshi@buyeremaildomain.com","buyerProvidedInfo":{"name":"Marcin","selectedWallet":"bitpay","emailAddress":"satoshi@buyeremaildomain.com"},"paymentSubtotals":{"BTC":71900,"BCH":11685700,"ETH":9583000000000000,"GUSD":1200,"PAX":12000000000000000000,"BUSD":12000000000000000000,"USDC":12000000,"DOGE":13762083400,"LTC":20927800,"MATIC":13025073000000000000,"USDC_m":12000000},"paymentTotals":{"BTC":72000,"BCH":11685700,"ETH":9583000000000000,"GUSD":1200,"PAX":12000000000000000000,"BUSD":12000000000000000000,"USDC":12000000,"DOGE":13762083400,"LTC":20927800,"MATIC":13025073000000000000,"USDC_m":12000000},"paymentDisplayTotals":{"BTC":"0.000720","BCH":"0.116857","ETH":"0.009583","GUSD":"12.00","PAX":"12.00","BUSD":"12.00","USDC":"12.00","DOGE":"137.620834","LTC":"0.209278","MATIC":"13.025073","USDC_m":"12.00"},"paymentDisplaySubTotals":{"BTC":"0.000719","BCH":"0.116857","ETH":"0.009583","GUSD":"12.00","PAX":"12.00","BUSD":"12.00","USDC":"12.00","DOGE":"137.620834","LTC":"0.209278","MATIC":"13.025073","USDC_m":"12.00"},"exchangeRates":{"BTC":{"USD":16678.62,"BCH":162.27190686942083,"ETH":13.317964769950652,"GUSD":16678.62,"PAX":16678.62,"BUSD":16678.62,"USDC":16678.62,"DOGE":191235.02412994052,"LTC":290.72023705769567,"MATIC":18099.42485078676,"USDC_m":16678.62},"BCH":{"USD":102.69,"BTC":0.00615832083958021,"ETH":0.08199849881022725,"GUSD":102.69,"PAX":102.69,"BUSD":102.69,"USDC":102.69,"DOGE":1177.4310241436997,"LTC":1.7899599093602927,"MATIC":111.43787303309823,"USDC_m":102.69},"ETH":{"USD":1252.17,"BTC":0.07509265367316342,"BCH":12.182783325280072,"GUSD":1252.17,"PAX":1252.17,"BUSD":1252.17,"USDC":1252.17,"DOGE":14357.22860553137,"LTC":21.826215792225906,"MATIC":1358.8388497015737,"USDC_m":1252.17},"GUSD":{"USD":1,"BTC":5.997001499250375E-5,"BCH":0.009729336532004496,"ETH":7.985051982688407E-4,"PAX":1,"BUSD":1,"USDC":1,"DOGE":11.46587812000876,"LTC":0.017430712916158272,"MATIC":1.0851871947911016,"USDC_m":1},"PAX":{"USD":1,"BTC":5.997001499250375E-5,"BCH":0.009729336532004496,"ETH":7.985051982688407E-4,"GUSD":1,"BUSD":1,"USDC":1,"DOGE":11.46587812000876,"LTC":0.017430712916158272,"MATIC":1.0851871947911016,"USDC_m":1},"BUSD":{"USD":1,"BTC":5.997001499250375E-5,"BCH":0.009729336532004496,"ETH":7.985051982688407E-4,"GUSD":1,"PAX":1,"USDC":1,"DOGE":11.46587812000876,"LTC":0.017430712916158272,"MATIC":1.0851871947911016,"USDC_m":1},"USDC":{"USD":1,"BTC":5.997001499250375E-5,"BCH":0.009729336532004496,"ETH":7.985051982688407E-4,"GUSD":1,"PAX":1,"BUSD":1,"DOGE":11.46587812000876,"LTC":0.017430712916158272,"MATIC":1.0851871947911016,"USDC_m":1},"DOGE":{"USD":0.0871961,"BTC":5.229151424287856E-6,"BCH":8.483602011783173E-4,"ETH":6.962653911876966E-5,"GUSD":0.0871961,"PAX":0.0871961,"BUSD":0.0871961,"USDC":0.0871961,"LTC":0.001519890186508628,"MATIC":0.09462409115572437,"USDC_m":0.0871961},"LTC":{"USD":57.34000000000001,"BTC":0.0034386806596701657,"BCH":0.5578801567451379,"ETH":0.04578628806873533,"GUSD":57.34000000000001,"PAX":57.34000000000001,"BUSD":57.34000000000001,"USDC":57.34000000000001,"DOGE":657.4534514013025,"MATIC":62.224633749321775,"USDC_m":57.34000000000001},"MATIC":{"USD":0.9213000000000001,"BTC":5.525037481259372E-5,"BCH":0.008963637746935744,"ETH":7.35662839165083E-4,"GUSD":0.9213000000000001,"PAX":0.9213000000000001,"BUSD":0.9213000000000001,"USDC":0.9213000000000001,"DOGE":10.563513511964073,"LTC":0.016058915809656616,"USDC_m":0.9213000000000001},"USDC_m":{"USD":1,"BTC":5.997001499250375E-5,"BCH":0.009729336532004496,"ETH":7.985051982688407E-4,"GUSD":1,"PAX":1,"BUSD":1,"USDC":1,"DOGE":11.46587812000876,"LTC":0.017430712916158272,"MATIC":1.0851871947911016}},"minerFees":{"BTC":{"satoshisPerByte":1,"totalFee":100,"fiatAmount":0.02},"BCH":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"ETH":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"GUSD":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"PAX":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"BUSD":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"USDC":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"DOGE":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"LTC":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"MATIC":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0},"USDC_m":{"satoshisPerByte":0,"totalFee":0,"fiatAmount":0}},"shopper":{},"jsonPayProRequired":false,"merchantName":"SUMO Heavy Industries LLC","bitpayIdRequired":false,"itemizedDetails":[],"shopify":{},"transactionCurrency":"BTC","supportedTransactionCurrencies":{"BTC":{"enabled":true},"BCH":{"enabled":true},"ETH":{"enabled":true},"GUSD":{"enabled":true},"PAX":{"enabled":true},"BUSD":{"enabled":true},"USDC":{"enabled":true},"XRP":{"enabled":false},"DOGE":{"enabled":true},"LTC":{"enabled":true},"APE":{"enabled":false},"EUROC":{"enabled":false},"MATIC":{"enabled":true},"MATIC_e":{"enabled":false},"ETH_m":{"enabled":false},"USDC_m":{"enabled":true},"BUSD_m":{"enabled":false},"DAI_m":{"enabled":false},"WBTC_m":{"enabled":false},"SHIB_m":{"enabled":false}},"paymentCodes":{"BTC":{"BIP72b":"bitcoin:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3","BIP73":"https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"BCH":{"BIP72b":"bitcoincash:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3","BIP73":"https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"ETH":{"EIP681":"ethereum:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"GUSD":{"EIP681b":"ethereum:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"PAX":{"EIP681b":"ethereum:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"BUSD":{"EIP681b":"ethereum:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"USDC":{"EIP681b":"ethereum:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"DOGE":{"BIP72b":"dogecoin:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3","BIP73":"https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"LTC":{"BIP72b":"litecoin:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3","BIP73":"https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"MATIC":{"EIP681":"matic:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"USDC_m":{"EIP681b":"matic:?r=https://test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"}},"universalCodes":{"paymentString":"https://link.test.bitpay.com/i/4enjVLZH9fUADcAeYRKip3"},"token":"F7uTfepHfSyCepeffoA8uj2oeHGoE7w6HgCadXUHXWQJ"}